{
  "B.2. Protection and restoration of biodiversity and ecosystems": {
    "B.2.1. Conservation and restoration of strategic terrestrial ecosystems.": {
      "B.2.1.6. Restoration of degraded soils and regeneration of soil fertility.": [
        {
          "id": 2,
          "SbN": "Passive restoration"
        }
      ],
      "B.2.1.1. Conservation of forests and other strategic terrestrial ecosystems.": [
        {
          "id": 1,
          "SbN": "Forest conservation"
        }
      ],
      "B.2.1.2. Recovery of terrestrial ecosystems degraded by productive activities.": [
        {
          "id": 4,
          "SbN": "Active restoration - Nucleation"
        },
        {
          "id": null,
          "SbN": "Active restoration - enrichment"
        }
      ],
      "B.2.1.4. Urban reforestation or tree planting to improve air quality and regulate temperature.": [
        {
          "id": null,
          "SbN": "nan"
        }
      ]
    },
    "B.2.2. Agriculture, forestry and other sustainable land uses.": {
      "B.2.2.3. Mixed agroforestry uses and sustainable livestock production.": [
        {
          "id": 20,
          "SbN": "Agroforestry"
        }
      ]
    }
  },
  "A.3. Ecosystem-based adaptation": {
    "A.3.1. Use of biodiversity and ecosystem services to reduce vulnerability and physical climate risk.": {
      "A.3.1.9. Other activities using biodiversity and ecosystem services to reduce vulnerability and physical climate risk. Sustainable blue economy: Classify if it deals with marine-coastal biodiversity or ecosystem services.": [
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": 6,
          "SbN": "Floodplains"
        },
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": null,
          "SbN": "nan"
        }
      ],
      "A.3.1.3. Restoration and integrated management of basins and sub-basins. Sustainable blue economy: Classify when it generates a positive impact on the marine-coastal zone.": [
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": null,
          "SbN": "nan"
        }
      ],
      "A.3.1.4. Recovery and/or reforestation of urban forests that perform vital functions for sustainability and contribute to mitigating climate risk.": [
        {
          "id": 14,
          "SbN": "Green spaces"
        },
        {
          "id": 17,
          "SbN": "Urban watershed forestry"
        }
      ],
      "A.3.1.5. Filter gardens in urban water bodies to reduce flood risk.": [
        {
          "id": 12,
          "SbN": "Rain gardens"
        }
      ]
    }
  },
  "A.2. Agriculture, land use, livestock activity, fishing, mariculture or aquaculture": {
    "A.2.1. Measures that contribute to maintaining or improving the productivity of agricultural, livestock, fishing, mariculture or marine/continental aquaculture systems.": {
      "A.2.1.7. Other measures that contribute to maintaining or improving the productivity of agricultural, livestock, fishing, mariculture or marine/continental aquaculture systems. Sustainable blue economy: Classify when these are other measures that contribute to sustainably maintaining or improving marine fishery productivity or sustainable mariculture.": [
        {
          "id": null,
          "SbN": "nan"
        }
      ]
    }
  },
  "M.4. Agriculture, forestry, land use and fisheries.": {
    "M.4.1. Agriculture: energy efficiency, carbon sequestration, GHG emissions reduction": {
      "M.4.1.2. Agricultural projects that contribute to increasing soil carbon stocks or preventing loss of soil carbon through erosion control measures.": [
        {
          "id": null,
          "SbN": "nan"
        }
      ]
    }
  },
  "B.1. Water resources sustainability and protection": {
    "B.1.1. Water conservation.": {
      "B.1.1.1. Restoration and integrated management of basins and sub-basins.": [
        {
          "id": 5,
          "SbN": "Riparian vegetation restoration"
        },
        {
          "id": 7,
          "SbN": "Renaturalization of water bodies"
        }
      ],
      "B.1.1.2. Investment in remediation, recovery and/or decontamination of surface or groundwater bodies. Sustainable blue economy: Classify when the action takes place in the sea, coastal lagoons, marshes or estuaries.": [
        {
          "id": null,
          "SbN": "nan"
        }
      ]
    },
    "B.1.3. Wastewater.": {
      "B.1.3.3. Sustainable drainage systems, such as filter gardens in water bodies.": [
        {
          "id": 8,
          "SbN": "Green filter area"
        },
        {
          "id": 10,
          "SbN": "Bioretention ponds"
        },
        {
          "id": 9,
          "SbN": "Vegetated channels"
        },
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": 13,
          "SbN": "Infiltration trenches"
        },
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": null,
          "SbN": "nan"
        }
      ],
      "B.1.3.1. Wastewater treatment plants that ensure the health of the receiving water body ecosystems. Sustainable blue economy: Classify if it contributes to preventing or mitigating marine pollution.": [
        {
          "id": 11,
          "SbN": "Constructed wetlands"
        }
      ],
      "B.1.3.4. Technological innovation in the wastewater cycle: reuse, aquifer recharge.": [
        {
          "id": null,
          "SbN": "nan"
        }
      ]
    }
  },
  "A.4. Resilient infrastructure for population adaptation to adverse climate change events": {
    "A.4.2. Construction, maintenance and rehabilitation of infrastructure to strengthen the resilience of continental populations.": {
      "A.4.2.1. Green or grey infrastructure to strengthen the resilience of continental populations.": [
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": 16,
          "SbN": "Adapted green pavements"
        },
        {
          "id": 15,
          "SbN": "Floodable parks"
        },
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": 19,
          "SbN": "Cycle-pedestrian routes with green pavement"
        },
        {
          "id": 18,
          "SbN": "Green roofs"
        },
        {
          "id": null,
          "SbN": "nan"
        }
      ]
    }
  },
  "A.1. Water Management and Supply and Sanitation": {
    "A.1.1. Measures that contribute to improving access to and/or the efficient use of water.": {
      "A.1.1.2. Installation of equipment for harvesting and storing domestic rainwater.": [
        {
          "id": 21,
          "SbN": "Rainwater harvesting"
        }
      ],
      "A.1.1.4. Water supply activities for irrigation of agricultural production and strengthening food and nutritional security (FNS).": [
        {
          "id": null,
          "SbN": "nan"
        }
      ],
      "A.1.1.7. Other measures that contribute to improving access to and/or the efficient use of water.": [
        {
          "id": null,
          "SbN": "nan"
        }
      ]
    }
  },
  "M.8. Final energy efficiency in buildings or equipment.": {
    "M.8.1. Energy efficiency, renewable energies, reduction of CO2e emissions and carbon sinks in buildings and public spaces.": {
      "M.8.1.1. Measures that reduce net energy consumption, resource consumption or CO2e emissions, or that increase plant-based carbon sinks in buildings in new, existing areas or associated grounds.": [
        {
          "id": null,
          "SbN": "nan"
        }
      ]
    }
  }
}