{
  "B.2. Proteção e restauração da biodiversidade e dos ecossistemas": {
    "B.2.1. Conservação e restauração de ecossistemas terrestres estratégicos.": {
      "B.2.1.6. Restauração de solos degradados e regeneração da fertilidade do solo.": [
        {
          "id": 2,
          "SbN": "Restauração passiva"
        }
      ],
      "B.2.1.1. Conservação de florestas e outros ecossistemas terrestres estratégicos.": [
        {
          "id": 1,
          "SbN": "Conservação da floresta"
        }
      ],
      "B.2.1.2. Recuperação de ecossistemas terrestres degradados por atividades produtivas.": [
        {
          "id": 4,
          "SbN": "Restauração ativa - Nucleação"
        },
        {
          "id": null,
          "SbN": "Restauração ativa - enriquecimento"
        }
      ],
      "B.2.1.4. Reflorestamento ou arborização urbana para melhorar a qualidade do ar e regular a temperatura.": [
        {
          "id": null,
          "SbN": "nan"
        }
      ]
    },
    "B.2.2. Agricultura, silvicultura e outros usos sustentáveis do solo.": {
      "B.2.2.3. Usos mistos agroflorestais e produção pecuária sustentável.": [
        {
          "id": 20,
          "SbN": "Agrofloresta"
        }
      ]
    }
  },
  "A.3. Adaptação baseada em ecossistemas": {
    "A.3.1. Utilização da biodiversidade e dos serviços ecossistêmicos para reduzir a vulnerabilidade e o risco físico climático.": {
      "A.3.1.9. Outras atividades com uso da biodiversidade e dos serviços ecossistêmicos para reduzir a vulnerabilidade e o risco físico climático. Economia azul sustentável: Classifica se trata de biodiversidade ou serviços ecossistêmicos marinho-costeiros.": [
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": 6,
          "SbN": "Planícies de inundação"
        },
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": null,
          "SbN": "nan"
        }
      ],
      "A.3.1.3. Restauração e gestão integral de bacias e sub-bacias hidrográficas. Economia azul sustentável: Classifica quando gerar um impacto positivo sobre a zona marinho-costeira.": [
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": null,
          "SbN": "nan"
        }
      ],
      "A.3.1.4. Recuperação e/ou reflorestamento de florestas urbanas que desempenham funções vitais para a sustentabilidade e contribuem para a mitigação do risco climático.": [
        {
          "id": 14,
          "SbN": "Espaços verdes"
        },
        {
          "id": 17,
          "SbN": "Silvicultura de bacia urbana"
        }
      ],
      "A.3.1.5. Jardins de filtragem em corpos d'água urbanos para reduzir o risco de inundações.": [
        {
          "id": 12,
          "SbN": "Jardins de chuva"
        }
      ]
    }
  },
  "A.2. Agricultura, uso da terra, atividade pecuária, pesca, maricultura ou aquicultura": {
    "A.2.1. Medidas que contribuem para a manutenção ou melhoria da produtividade dos sistemas agrícolas, pecuários, pesqueiros, de maricultura ou na aquicultura marinha ou continental.": {
      "A.2.1.7. Outras medidas que contribuem para a manutenção ou melhoria da produtividade dos sistemas agrícolas, pecuários, pesqueiros, de maricultura ou na aquicultura marinha ou continental. Economia azul sustentável: Classifica quando se tratar de outras medidas que contribuam para manter ou melhorar de forma sustentável a produtividade da pesca marinha ou maricultura sustentável.": [
        {
          "id": null,
          "SbN": "nan"
        }
      ]
    }
  },
  "M.4. Agricultura, silvicultura, uso da terra e pesca.": {
    "M.4.1. Agricultura: eficiência energética, sequestro de carbono, redução de emissões de GEE": {
      "M.4.1.2. Projetos agrícolas que contribuam para aumentar as reservas de carbono no solo ou para evitar a perda de carbono do solo através de medidas de controle da erosão.": [
        {
          "id": null,
          "SbN": "nan"
        }
      ]
    }
  },
  "B.1. Sustentabilidade e proteção dos recursos hídricos": {
    "B.1.1. Conservação da água.": {
      "B.1.1.1. Restauração e gestão integral de bacias e sub-bacias hidrográficas.": [
        {
          "id": 5,
          "SbN": "Restauração da vegetação ripária"
        },
        {
          "id": 7,
          "SbN": "Renaturalização de corpos d'água"
        }
      ],
      "B.1.1.2. Investimento em remediação, recuperação e/ou descontaminação de corpos d'água superficiais ou subterrâneos. Economia azul sustentável: Classifica quando a ação se realiza no mar, lagoas costeiras, pântanos ou estuários.": [
        {
          "id": null,
          "SbN": "nan"
        }
      ]
    },
    "B.1.3. Águas residuais.": {
      "B.1.3.3. Sistemas de drenagem sustentáveis, como jardins de filtragem em corpos d'água.": [
        {
          "id": 8,
          "SbN": "Área de filtro verde"
        },
        {
          "id": 10,
          "SbN": "Tanques de biorretenção"
        },
        {
          "id": 9,
          "SbN": "Canais vegetados"
        },
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": 13,
          "SbN": "Valas de infiltração"
        },
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": null,
          "SbN": "nan"
        }
      ],
      "B.1.3.1. Estações de tratamento de águas residuais que garantam a saúde dos ecossistemas do corpo receptor. Economia azul sustentável: Classifica se contribui para prevenir ou mitigar a poluição marinha.": [
        {
          "id": 11,
          "SbN": "Áreas úmidas artificiais"
        }
      ],
      "B.1.3.4. Inovação tecnológica no ciclo de águas residuais: reúso, recarga de aquíferos.": [
        {
          "id": null,
          "SbN": "nan"
        }
      ]
    }
  },
  "A.4. Infraestrutura resiliente para a adaptação da população frente a eventos adversos das mudanças climáticas": {
    "A.4.2. Construção, manutenção e reabilitação de infraestrutura para fortalecer a resiliência de populações continentais.": {
      "A.4.2.1. Infraestrutura verde ou cinzenta para fortalecer a resiliência de populações continentais.": [
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": 16,
          "SbN": "Pavimentos verdes adaptados"
        },
        {
          "id": 15,
          "SbN": "Parques inundáveis"
        },
        {
          "id": null,
          "SbN": "nan"
        },
        {
          "id": 19,
          "SbN": "Vias ciclopedestres com pavimento verde"
        },
        {
          "id": 18,
          "SbN": "Telhados verdes"
        },
        {
          "id": null,
          "SbN": "nan"
        }
      ]
    }
  },
  "A.1. Gestão e Abastecimento de Água e Saneamento": {
    "A.1.1. Medidas que contribuem para melhorar o acesso e/ou o uso eficiente da água.": {
      "A.1.1.2. Instalação de equipamentos de captação e armazenamento de águas pluviais domésticas.": [
        {
          "id": 21,
          "SbN": "Captação de água"
        }
      ],
      "A.1.1.4. Atividades de fornecimento de água para irrigação da produção agrícola e o fortalecimento da segurança alimentar e nutricional (SAN).": [
        {
          "id": null,
          "SbN": "nan"
        }
      ],
      "A.1.1.7. Outras medidas que contribuem para melhorar o acesso e/ou o uso eficiente da água.": [
        {
          "id": null,
          "SbN": "nan"
        }
      ]
    }
  },
  "M.8. Eficiência energética de uso final em edifícios ou equipamentos.": {
    "M.8.1. Eficiência energética, energias renováveis, redução de emissões de CO2e e sumidouros de carbono em edifícios e espaços públicos.": {
      "M.8.1.1. Medidas que reduzam o consumo líquido de energia, o consumo de recursos ou as emissões de CO2e, ou que aumentem os sumidouros de carbono de origem vegetal em edifícios de zonas novas, existentes ou terrenos associados.": [
        {
          "id": null,
          "SbN": "nan"
        }
      ]
    }
  }
}